Revit 2015 API
ExporterIFC.SetBuilding Method
 Sets the global IfcBuilding object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2013
Syntax
C#
[ObsoleteAttribute("This handle is no longer used by native code.")]
public void SetBuilding(
	IFCAnyHandle building
)
Visual Basic
<ObsoleteAttribute("This handle is no longer used by native code.")> _
Public Sub SetBuilding ( _
	building As IFCAnyHandle _
)
Visual C++
[ObsoleteAttribute(L"This handle is no longer used by native code.")]
public:
void SetBuilding(
	IFCAnyHandle^ building
)
Parameters
building
Type: Autodesk.Revit.DB.IFC.IFCAnyHandle
 The IfcBuilding handle.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace